Белгипрозем_2017/src/DataProcessors/мСозданиеАктовИзАктирования/мСозданиеАктовИзАктирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>мСозданиеАктовИзАктирования</name>
</mdclass:DataProcessor>

Белгипрозем_2017/src/InformationRegisters/СвязиДокументов/СвязиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязиДокументов</name>
  <resources>
    <name>СвязанныйДокументОтправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Установил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.ВходящееСообщениеСВД</types>
      <types>DocumentRef.ИсходящееСообщениеСВД</types>
      <types>CatalogRef.ШаблоныИсходящихДокументов</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ШаблоныВнутреннихДокументов</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ШаблоныВходящихДокументов</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСвязи</name>
    <type>
      <types>CatalogRef.ТипыСвязей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СвязанныйДокумент</name>
    <type>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.ВходящееСообщениеСВД</types>
      <types>DocumentRef.ИсходящееСообщениеСВД</types>
      <types>CatalogRef.ШаблоныИсходящихДокументов</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ШаблоныВнутреннихДокументов</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ШаблоныВходящихДокументов</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СвязаннаяСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьСвязанныйДокумент</name>
    <type>
      <types>CatalogRef.ШаблоныИсходящихДокументов</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>String</types>
      <types>CatalogRef.ШаблоныВнутреннихДокументов</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ШаблоныВходящихДокументов</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Enums/мСостоянияАктовВыполненныхРабот/мСостоянияАктовВыполненныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>мСостоянияАктовВыполненныхРабот</name>
  <enumValues>
    <name>Черновик</name>
    <comment>При создании акта</comment>
  </enumValues>
  <enumValues>
    <name>Подготовлен</name>
    <comment>Акт распечатан и готов к отправке</comment>
  </enumValues>
  <enumValues>
    <name>НаправленЗаказчику</name>
    <comment>Подготовлено исходящее письмо</comment>
  </enumValues>
  <enumValues>
    <name>ВрученЗаказчику</name>
    <comment>Получено уведомление о доставке заказчику</comment>
  </enumValues>
  <enumValues>
    <name>ПодписанЗаказчикомКопия</name>
    <comment>Есть факсовая копия подписанного акта</comment>
  </enumValues>
  <enumValues>
    <name>ПодписанЗаказчиком</name>
    <comment>Подписанный акт возвращен заказчиком</comment>
  </enumValues>
  <enumValues>
    <name>ПодписанЗаказчикомСЗамечаниями</name>
    <comment>Акт возвращен с замечаниями заказчика</comment>
  </enumValues>
  <enumValues>
    <name>НеПодписан</name>
    <comment>Не подписан заказчиком</comment>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Enums/мВидыАктовВыполненныхРабот/мВидыАктовВыполненныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>мВидыАктовВыполненныхРабот</name>
  <enumValues>
    <name>Обычный</name>
  </enumValues>
  <enumValues>
    <name>Промежуточный</name>
  </enumValues>
  <enumValues>
    <name>Окончательный</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Documents/мАктирование/мАктирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мАктирование</name>
  <registerRecords>AccumulationRegister.Сметы</registerRecords>
  <registerRecords>AccumulationRegister.УчетПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.НачислениеЗП</registerRecords>
  <registerRecords>AccumulationRegister.УчетДоговоров</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПокупателями</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Зарплата</name>
    <attributes>
      <name>ЭтапДоговора</name>
      <type>
        <types>CatalogRef.мЭтапыДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>КТУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>Коэффициент понижающий или повышающий</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемРабот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Начислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбоснованиеКоэффициента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАкта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеОсновноеПодразделение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовоеНачисление</name>
      <comment>Сумма сделки без учета +/- коэф.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРабот</name>
      <type>
        <types>CatalogRef.мОбъектыРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Акты</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ВнутренниеДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапДоговора</name>
      <type>
        <types>CatalogRef.мЭтапыДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАкта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаАкта</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПрочих</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Акт</name>
      <type>
        <types>CatalogRef.ВнутренниеДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъектыРабот</name>
    <attributes>
      <name>ЭтапДоговора</name>
      <type>
        <types>CatalogRef.мЭтапыДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРабот</name>
      <type>
        <types>CatalogRef.мОбъектыРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПрочих</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗИС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/Catalogs/мРеквизитыАктовВыполненныхРабот/мРеквизитыАктовВыполненныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мРеквизитыАктовВыполненныхРабот</name>
  <owners>Catalog.ВнутренниеДокументы</owners>
  <attributes>
    <name>ЭтапДоговора</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.мСтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсвобождениеОтНДС</name>
    <type>
      <types>CatalogRef.мОсвобождениеОтНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеАкта</name>
    <type>
      <types>EnumRef.мСостоянияАктовВыполненныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученЗаказчиком</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Возвращен</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрученЗаказчику</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАкта</name>
    <type>
      <types>EnumRef.мВидыАктовВыполненныхРабот</types>
    </type>
  </attributes>
</mdclass:Catalog>

Белгипрозем_2017/src/Catalogs/ПапкиВнутреннихДокументов/ПапкиВнутреннихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПапкиВнутреннихДокументов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>мАктыВыполненныхРабот</name>
      <description>Акты выполненных работ *</description>
    </items>
    <items>
      <name>мДела</name>
      <description>Дела п</description>
    </items>
    <items>
      <name>мДелаУслуги</name>
      <description>Дела-услуги</description>
    </items>
    <items>
      <name>мДоговоры</name>
      <description>Договоры п</description>
    </items>
    <items>
      <name>мДокументыТехАрхива</name>
      <description>Документы техархива п</description>
    </items>
    <items>
      <name>мДопСоглашения</name>
      <description>Доп соглашения п</description>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

Белгипрозем_2017/src/DataProcessors/мСозданиеАктовИзАктирования/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мАктированиеАкты.Договор,
		|	мАктированиеАкты.ЭтапДоговора,
		|	мАктированиеАкты.НомерАкта,
		|	мАктированиеАкты.ДатаАкта,
		|	мАктированиеАкты.Сумма,
		|	мАктированиеАкты.НДС,
		|	ИСТИНА КАК Пометка,
		|	СвязиДокументов.СвязанныйДокумент КАК Акт,
		|	мРеквизитыАктовВыполненныхРабот.СостояниеАкта КАК Состояние,
		|	мАктированиеАкты.Договор.Корреспондент.ЮрФизЛицо КАК ВидЛица
		|ИЗ
		|	Документ.мАктирование.Акты КАК мАктированиеАкты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиДокументов КАК СвязиДокументов
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.мРеквизитыАктовВыполненныхРабот КАК мРеквизитыАктовВыполненныхРабот
		|			ПО СвязиДокументов.СвязанныйДокумент = мРеквизитыАктовВыполненныхРабот.Владелец
		|				И (СвязиДокументов.СвязанныйДокумент.ВидДокумента = &ВидДокумента)
		|				И (НЕ мРеквизитыАктовВыполненныхРабот.Владелец.ПометкаУдаления)
		|		ПО мАктированиеАкты.Договор = СвязиДокументов.Документ
		|			И мАктированиеАкты.НомерАкта = СвязиДокументов.СвязанныйДокумент.РегистрационныйНомер
		|			И (СвязиДокументов.ТипСвязи = &ТипСвязи)
		|			И (НЕ мРеквизитыАктовВыполненныхРабот.Владелец.ПометкаУдаления)
		|ГДЕ
		|	мАктированиеАкты.Ссылка = &Актирование";
	
	Запрос.УстановитьПараметр("ВидДокумента", Справочники.ВидыВнутреннихДокументов.АктВыполненныхРабот);
	Запрос.УстановитьПараметр("Актирование", Актирование);
	Запрос.УстановитьПараметр("ТипСвязи", Справочники.ТипыСвязей.Имеет);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ЗначениеВРеквизитФормы(Результат, "Акты");
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	Состояние("Выполняется чтение документа...");
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для каждого Стр Из Акты Цикл
		Стр.Пометка = Истина;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для каждого Стр Из Акты Цикл
		Стр.Пометка = Ложь;
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура СоздатьАктыНаСервере()
	Для каждого Стр Из Акты Цикл
		Если Не Стр.Пометка Тогда
			Продолжить;
		КонецЕсли; 
		НачатьТранзакцию();
		
		Акт = Справочники.ВнутренниеДокументы.СоздатьЭлемент();
		Акт.ДатаРегистрации = Стр.ДатаАкта;
		Акт.РегистрационныйНомер = Стр.НомерАкта;
		Акт.Папка = Справочники.ПапкиВнутреннихДокументов.мАктыВыполненныхРабот;
		Акт.ВидДокумента = Справочники.ВидыВнутреннихДокументов.АктВыполненныхРабот;
		Акт.Заголовок = "Акт выполненных работ " + Стр.НомерАкта + " " + Формат(Стр.ДатаАкта, "ДЛФ=D");;
		Акт.ГрифДоступа = Стр.Договор.ГрифДоступа;
		Акт.Организация = Стр.Договор.Организация;
		Акт.ВопросДеятельности = Стр.Договор.ВопросДеятельности;
		Акт.ЭтапДоговора = Стр.ЭтапДоговора;
		Акт.Подготовил = Пользователи.ТекущийПользователь();
		Акт.Утвердил = Стр.Договор.Утвердил;
		Акт.Корреспондент = Стр.Договор.Корреспондент;
		Акт.КонтактноеЛицо = Стр.Договор.КонтактноеЛицо;
		Акт.ПодписалОтКорреспондента = Стр.Договор.ПодписалОтКорреспондента;
		Акт.ДатаСоздания = ТекущаяДатаСеанса();
		Акт.Валюта = Стр.Договор.Валюта;
		Акт.Сумма = Стр.Сумма;
		
		Если ЗначениеЗаполнено(Акт.Корреспондент) Тогда 
			Строка = Акт.Корреспонденты.Добавить();
			Строка.Корреспондент = Акт.Корреспондент;
			Строка.КонтактноеЛицо = Акт.КонтактноеЛицо;
			Строка.ПодписалОтКорреспондента = Акт.ПодписалОтКорреспондента;		
		КонецЕсли;
		
		ДопРеквизиты = Акт.ДополнительныеСвойства;
		ДопРеквизиты.Вставить("ЭтапДоговора", Стр.ЭтапДоговора);
		ДопРеквизиты.Вставить("СтавкаНДС", Стр.ЭтапДоговора.СтавкаНДС);
		ДопРеквизиты.Вставить("Сумма", Стр.Сумма);
		ДопРеквизиты.Вставить("СуммаНДС", Стр.НДС);
		ДопРеквизиты.Вставить("ОсвобождениеОтНДС", Стр.ЭтапДоговора.ОсвобождениеОтНДС);
		ДопРеквизиты.Вставить("СостояниеАкта", Перечисления.мСостоянияАктовВыполненныхРабот.Подготовлен);
		ДопРеквизиты.Вставить("ВидАкта", Перечисления.мВидыАктовВыполненныхРабот.Обычный);
		
		Акт.Записать();
		
		//ДопРекв = Справочники.мРеквизитыАктовВыполненныхРабот.СоздатьЭлемент();
		//ДопРекв.Владелец = Акт.Ссылка;
		//ДопРекв.ОсвобождениеОтНДС = Стр.ЭтапДоговора.ОсвобождениеОтНДС;
		//ДопРекв.СостояниеАкта = Перечисления.мСостоянияАктовВыполненныхРабот.Подготовлен;
		//ДопРекв.СтавкаНДС = Стр.ЭтапДоговора.СтавкаНДС;
		//ДопРекв.СуммаНДС = Стр.ЭтапДоговора.СуммаНДС;
		//ДопРекв.ЭтапДоговора = Стр.ЭтапДоговора;
		//ДопРекв.Записать();
		
		ЗафиксироватьТранзакцию();
		
		Стр.Акт = Акт.Ссылка;
		Стр.Состояние = Перечисления.мСостоянияАктовВыполненныхРабот.Подготовлен;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СоздатьАкты(Команда)
	Состояние("Выполняется создание актов...");
	СоздатьАктыНаСервере();
	ПоказатьОповещениеПользователя("Акты созданы!");
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусНаСервере()
	Для каждого Стр Из Акты Цикл
		Если Стр.Пометка Тогда
			Если ЗначениеЗаполнено(Стр.Акт) Тогда
				Акт = Стр.Акт.ПолучитьОбъект();
				
				ДопРеквизиты = Акт.ДополнительныеСвойства;
				//ДопРеквизиты.Вставить("ЭтапДоговора", Стр.ЭтапДоговора);
				//ДопРеквизиты.Вставить("СтавкаНДС", Стр.ЭтапДоговора.СтавкаНДС);
				//ДопРеквизиты.Вставить("СуммаНДС", Стр.ЭтапДоговора.СуммаНДС);
				//ДопРеквизиты.Вставить("ОсвобождениеОтНДС", Стр.ЭтапДоговора.ОсвобождениеОтНДС);
				ДопРеквизиты.Вставить("СостояниеАкта", Состояние);
				
				Акт.ОбменДанными.Загрузка = Истина;
				Акт.Записать();
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатус(Команда)
	Если ВвестиЗначение(Состояние, "Выберите состояние акта") Тогда  
		УстановитьСтатусНаСервере();
		ПоказатьОповещениеПользователя("Состояние актов изменено!");
	КонецЕсли;
КонецПроцедуры
